export const STRINGS = {
  newProposal: {
    dialog: {
      addNew: "Додај нови предлог",
      title: "Нови предлог за гласање",
      description: "Попуните формулар да бисте додали нови предлог за гласање.",
    },
    success: {
      title: "Предлог успешно послат!",
      description: "Ваш предлог је додат и доступан је за гласање.",
    },
    status: {
      creating: "Креирање предлога... (потврдите трансакцију у новчанику)",
    },
    error: {
      title: "Грешка",
      descriptionRequired: "Опис предлога је обавезан.",
      titleRequired: "Наслов предлога је обавезан.",
      noVoteItems: "Морате додати барем једну тачку за гласање.",
      subitemsIncomplete: "Сви наслови и описи тачака за гласање су обавезни.",
      insufficientTokens:
        "Немате довољно токена за креирање предлога. За креирање предлога потребно је имати најмање 1 EVSD токен и делегирати их себи.",
      txRejectedByUser:
        "Трансакција је одбијена од стране корисника. Потребно је одобрити трансакцију у новчанику.",
      insufficientETH:
        "Недовољно средстава за плаћање трошкова трансакције (ETH).",
      insufficientEVSDTokens: "Недовољно EVSD токена за креирање предлога.",
      badData:
        "Проблем са прослеђеним подацима. Проверите да ли је адреса токена исправна и параметри одговарајући.",
      callException:
        "Трансакција је одбијена. Могућ проблем са адресом паметног уговора.",
      gasEstimate:
        "Неуспешна процена трошкова гаса. Проверите да ли испуњавате услове за предлог.",
      networkError: "Проблем са мрежом. Проверите вашу интернет везу.",
      networkChanged:
        "Дошло је до промене blockchain мреже. Одјавите се, а затим пријавите са одабраном мрежом и покушајте поново.",
      generic: (msg?: string) => `Грешка: ${msg ?? ""}`,
    },
    info: {
      checking: "Провера стања токена и делегација гласова...",
      creating: "Креирање предлога... (потврдите трансакцију у новчанику)",
      processing: "Обрада",
    },
    form: {
      title: {
        label: "Наслов предлога",
        placeholder: "Унесите наслов предлога",
      },
      description: {
        label: "Опис предлога",
        placeholder: "Детаљно опишите ваш предлог",
      },
      voteItems: {
        label: "Тачке за гласање",
        hint: "Додајте све тачке за које желите да се гласа",
        none: "Додајте подтачке предлога за које ће се гласати појединачно",
      },
      subItem: {
        add: "Додај тачку за гласање",
        title: {
          label: "Наслов тачке за гласање",
          placeholder: "Унесите наслов тачке за гласање",
        },
        description: {
          label: "Опис тачке за гласање предлога",
          placeholder: "Опишите детаљније ову тачку за гласање",
        },
        default: "Тачка",
      },
      document: {
        label: "Приложите документ (опционо)",
        pick: "Изаберите фајл",
      },
      submit: {
        default: "Додај предлог",
        loading: "Слање...",
      },
      attachment: {
        label: "Приложите документ (опционо)",
        button: "Изаберите фајл",
      },
    },
  },
  proposalCard: {
    voteButton: "Гласај",
  },
  user: {
    unknownUser: "Непознато",
  },
  userActivity: {
    timeLine: {
      title: "Све активности",
      created: "Креиран предлог",
      deleted: "Повучен предлог",
      youVoted: "Гласали сте",
      noActivity: "Нема активности",
      description: "Ваше активности на blockchain-y ће се појавити овде.",
    },
    userProposals: {
      title: "Моји предлози",
      noProposalsTitle: "Немате предлога",
      noProposalsDescription:
        "Када креирате предлог за гласање, појавиће се овде.",
      activeProposals: "Активни предлози",
      closedProposals: "Завршени предлози",
      addedAt: "Гласање започето",
      closedAt: "Гласање завршено",
    },
    votingHistory: {
      title: "Историја гласања",
      noHistoryTitle: "Још нисте гласали",
      noHistoryDescription:
        "Када гласате на предлозима, овде ће се приказати Ваша историја гласања.",
    },
  },
  voting: {
    voteOptions: {
      for: "за",
      against: "против",
      abstain: "уздржано",
    },
    results: {
      passed: "усвојено",
      failed: "није усвојено",
      noQuorum: "није достигнут кворум",
    },
    proposal: "Предлог",
    voteItem: "Тачка",
    quorum: "Кворум",
    quorumReached: "Достигнут",
    result: "Резултат",
  },
  proposal: {
    statusActive: "Гласање активно",
    statusClosed: "Гласање завршено",
    statusCancelled: "Предлог повучен",
    expiresAt: "Истиче за",
  },
  buttons: {
    cancelProposal: "Откажи",
  },
  results: {
    proposalInfo: {
      perFacultyVotesTitle: "Детаљи гласања по факултетима",
    },
  },
  membershipAcceptance: {
    title: "Добродошли у еВСД!",
    description:
      "Честитамо! Ваша кандидатура за чланство у еВСД је успешно изгласана. Да бисте могли да гласате и додајете предлоге потребно је да прихватите чланство.",
    rightsTitle: "Као члан еВСД имате право да:",
    rightsList: [
      "Гласате о предлозима",
      "Креирате нове предлоге",
      "Предлажете нове чланове",
      "Предлажете уклањање чланова",
    ],
    accept: "Прихватам чланство",
  },
};
